app/controllers/gists_controller.rb

  def index
    @gists = Gist.paginate(page: params[:page], per_page: 5).order('created_at DESC')
---
SELECT "gists".* FROM "gists" ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "gists"

  def search
    @gists = Gist.search(params[:search])
---
SELECT "gists".* FROM "gists" WHERE (snippet LIKE '%a%')

  def create
    @gist = Gist.new(gist_params)

    respond_to do |format|
      if @gist.save
---
INSERT INTO "gists" ("created_at", "date", "description", "lang", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 15 Mar 2014 15:29:09 UTC +00:00], ["date", Sat, 15 Mar 2014], ["description", ""], ["lang", "c"], ["snippet", "asd"], ["updated_at", Sat, 15 Mar 2014 15:29:09 UTC +00:00]]

  def update
    respond_to do |format|
      if @gist.update(gist_params)
---
UPDATE "gists" SET "description" = ?, "updated_at" = ? WHERE "gists"."id" = 1  [["description", "asdasdasd"], ["updated_at", Sat, 15 Mar 2014 16:02:01 UTC +00:00]]

  def destroy
    @gist.destroy
---
DELETE FROM "gists" WHERE "gists"."id" = ?  [["id", 4]]

    def set_gist
      @gist = Gist.find(params[:id])
---
SELECT "gists".* FROM "gists" WHERE "gists"."id" = ? LIMIT 1  [["id", "4"]]